'''Task_1'''
'''Напишіть код, який зформує строку, яка містить певну інформацію про 
символ за його номером у слові. Наприклад "The [номер символу] symbol 
in '[тут слово]' is '[символ з відповідним порядковим номером в слові]'". 
Слово та номер символу отримайте за допомогою input() або скористайтеся 
константою. Наприклад (слово - "Python" а номер символу 3) - "The 3 symbol 
in 'Python' is 't' ".'''


# word = str(input("Введите слово: "))
# num_symbol = int(input("Введите номер симовла: "))
# symbol = word[num_symbol - 1]
#
# print(f"В слове {word} символ под номером {num_symbol} - {symbol}.")



'''Task_2'''
'''Вести з консолі строку зі слів за допомогою input() (або скористайтеся 
константою). Напишіть код, який визначить кількість слів, в цих даних.'''


# sentence = input("Введите предложение: ")
# list = sentence.split()
# number = len(list)
#
# print(f"Количество слов в этом предлождении - {number}")



'''Task_3'''
'''Існує ліст з різними даними, наприклад lst1 = ['1', '2', 3, True, 'False', 
5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum']. Напишіть код, який сформує новий 
list (наприклад lst2), який би містив всі числові змінні (int, float), які є в 
lst1. Майте на увазі, що данні в lst1 не є статичними можуть змінюватись від 
запуску до запуску.'''


# lst_1 = [1, 2.3, "Python", True, 0, 5, 7.2, False]
# lst_2 = []
#
# for i in lst_1:
#     if type(i) is int:
#         lst_2.append(i)
#     elif type(i) is float:
#         lst_2.append(i)
#
# print(lst_2)