'''Task_1'''

'''Напишіть программу "Касир в кінотеватрі", яка буде виконувати наступне:

Попросіть користувача ввести свсвій вік (можно використати константу або input()).

- якщо користувачу менше 6 - вивести повідомлення "Де твої батьки?"

- якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"

- якщо користувачу більше 65 - вивести повідомлення "Покажіть пенсійне посвідчення!"

- якщо вік користувача містить цифру 7 - вивести повідомлення "Вам пощастить!"

- у будь-якому іншому випадку - вивести повідомлення "А білетів вже немає!"

P.S. На екран має бути виведено лише одне повідомлення, якщо вік користувача 
містить цифру 7 - тільки відповідне повідомлення! Також подумайте над варіантами, 
коли введені невірні або неадекватні (неможливі) дані.'''

print('\t\t\t\t\t\tКАСА IMAX')
print('Касир:\n-Вітаємо! Ця кінолента має обмеження за віком. Скільки Вам років?')

while True:
    try:
        visitor = int(input('Відвідувач:\n-Мені '))
        break
    except:
        print("Касир:\n-Це не вік!!! Спробуйте ще раз.")

kid = visitor >= 0 and visitor < 6
teenager = visitor < 16 and visitor >= 6
old_person = visitor > 65 and visitor <= 100
norm = visitor <= 65 and visitor >= 16
lucky = '7' in str(visitor)

if lucky:
    print("Касир:\n-Вам пощастить!")
elif kid:
    print("Касир:\n-Де твої батьки, дитинко? Тебе, мабудь, шукають?")
elif teenager:
    print("Касир:\n-Вибач, друже, цей фільм для дорослих.")
elif old_person:
    print("Касир:\n-У нас є акційна пропозиція для пенсіонерів.\nПокажіть Ваше пенсійне посвідчення, будь-ласка.")
elif norm:
    print("Касир:\n-Нажаль, білетів вже нема!")
else:
    print("Касир:\n-Цей вік не є можливим.")
